vertical-pod-autoscaler/experiments/sn-pbr-throughput/2minus/user.log
Running 15m test @ http://10.100.186.155:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 24.969ms, rate sampling interval: 77ms
  Thread calibration: mean lat.: 23.108ms, rate sampling interval: 68ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.14m     1.23m    4.20m    84.79%
    Req/Sec    10.97     13.11    52.00     83.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.24m 
 75.000%    4.07m 
 90.000%    4.12m 
 99.000%    4.20m 
 99.900%    4.22m 
 99.990%    4.23m 
 99.999%    4.23m 
100.000%    4.23m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.229     0.000000            1         1.00
   45154.303     0.100000         2005         1.11
  185466.879     0.200000         4026         1.25
  190054.399     0.300000         6063         1.43
  192544.767     0.400000         8130         1.67
  194510.847     0.500000        10102         2.00
  196345.855     0.550000        11029         2.22
  237895.679     0.600000        12054         2.50
  240779.263     0.650000        13028         2.86
  242745.343     0.700000        14072         3.33
  244449.279     0.750000        15104         4.00
  244973.567     0.775000        15618         4.44
  245497.855     0.800000        16151         5.00
  246022.143     0.825000        16614         5.71
  246415.359     0.850000        17035         6.67
  246939.647     0.875000        17613         8.00
  247201.791     0.887500        17889         8.89
  247463.935     0.900000        18090        10.00
  247857.151     0.912500        18319        11.43
  248512.511     0.925000        18581        13.33
  249692.159     0.937500        18799        16.00
  250085.375     0.943750        18928        17.78
  250347.519     0.950000        19038        20.00
  250609.663     0.956250        19202        22.86
  250740.735     0.962500        19301        26.67
  251002.879     0.968750        19451        32.00
  251133.951     0.971875        19504        35.56
  251265.023     0.975000        19558        40.00
  251396.095     0.978125        19618        45.71
  251527.167     0.981250        19672        53.33
  251789.311     0.984375        19772        64.00
  251789.311     0.985938        19772        71.11
  251920.383     0.987500        19837        80.00
  251920.383     0.989062        19837        91.43
  252051.455     0.990625        19884       106.67
  252051.455     0.992188        19884       128.00
  252182.527     0.992969        19915       142.22
  252182.527     0.993750        19915       160.00
  252313.599     0.994531        19948       182.86
  252313.599     0.995313        19948       213.33
  252444.671     0.996094        19968       256.00
  252444.671     0.996484        19968       284.44
  252575.743     0.996875        19985       320.00
  252575.743     0.997266        19985       365.71
  252706.815     0.997656        20002       426.67
  252706.815     0.998047        20002       512.00
  252706.815     0.998242        20002       568.89
  252837.887     0.998437        20012       640.00
  252837.887     0.998633        20012       731.43
  252837.887     0.998828        20012       853.33
  253493.247     0.999023        20019      1024.00
  253493.247     0.999121        20019      1137.78
  253624.319     0.999219        20024      1280.00
  253624.319     0.999316        20024      1462.86
  253624.319     0.999414        20024      1706.67
  253755.391     0.999512        20028      2048.00
  253755.391     0.999561        20028      2275.56
  253755.391     0.999609        20028      2560.00
  253886.463     0.999658        20034      2925.71
  253886.463     0.999707        20034      3413.33
  253886.463     0.999756        20034      4096.00
  253886.463     0.999780        20034      4551.11
  253886.463     0.999805        20034      5120.00
  253886.463     0.999829        20034      5851.43
  253886.463     0.999854        20034      6826.67
  253886.463     0.999878        20034      8192.00
  253886.463     0.999890        20034      9102.22
  253886.463     0.999902        20034     10240.00
  253886.463     0.999915        20034     11702.86
  253886.463     0.999927        20034     13653.33
  253886.463     0.999939        20034     16384.00
  253886.463     0.999945        20034     18204.44
  254017.535     0.999951        20035     20480.00
  254017.535     1.000000        20035          inf
#[Mean    =   188472.944, StdDeviation   =    73699.355]
#[Max     =   253886.464, Total count    =        20035]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20361 requests in 15.00m, 265.17MB read
  Socket errors: connect 0, read 1, write 10, timeout 0
  Non-2xx or 3xx responses: 2
Requests/sec:     22.62
Transfer/sec:    301.66KB